; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
; Reference Paper: Scala, Enrico, Patrik Haslum, Sylvie Thiébaux, and Miquel Ramirez. 
;                  "Subgoaling techniques for satisficing and optimal numeric planning." 
;                  Journal of Artificial Intelligence Research 68 (2020): 691-752. 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; The Sailing domain models a number of sailing boats 
; whose task is to rescue people in an unbounded area of the ocean. 
; The positions of the boat and people to be rescued are described by their 2D coordinates.
; The model tries to take into account the different speeds that can be obtained in a sailing boat. 
; Going upwind or fully downwind is slower. We assume that wind comes from the north.

(define (domain sailing)
    (:types boat - object person - object)
    (:predicates 
        (saved ?t - person)
    )
    (:functions
        (x ?b - boat)
        (y ?b - boat)
        (d ?t - person)
    )
    ;; Increment the value in the given counter by one
    (:action go_north_east
         :parameters (?b - boat)

         :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
    )
    (:action go_north_west
         :parameters (?b - boat)

         :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
    )
    (:action go_est
         :parameters (?b - boat)

         :effect (and(increase (x ?b) 3))
    )
    (:action go_west
         :parameters (?b - boat)

         :effect (and(decrease (x ?b) 3))
    )
    (:action go_south_west
         :parameters(?b - boat)

         :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
    )
    (:action go_south_east
         :parameters(?b - boat)

         :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
    )
    (:action go_south
         :parameters(?b - boat)

         :effect (and (decrease (y ?b) 2))
    )
    (:action save_person
        :parameters(?b - boat ?t - person)
        :precondition ( and  (>= (+ (x ?b) (y ?b)) (d ?t)) 
                             (>= (- (y ?b) (x ?b)) (d ?t)) 
                             (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25)) 
                             (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
                      )
        :effect (and(saved ?t))
    )

)

; problem
;;Setting seed to 1229
(define (problem instance_1_1_1229)

	(:domain sailing)

	(:objects
		b0  - boat
		p0  - person
	)

  (:init
		(= (x b0) 3)
(= (y b0) 0)


		(= (d p0) 32)


	)

	(:goal
		(and
			(saved p0)

		)
	)
)

; plan
1. (go_north_east b0)
   changed: (x b0) from 3 to 4.5, (y b0) from 0 to 1.5
   goals met: 0 of 1
2. (go_north_west b0)
   changed: (x b0) from 4.5 to 3, (y b0) from 1.5 to 3
   goals met: 0 of 1
3. (go_north_west b0)
   changed: (x b0) from 3 to 1.5, (y b0) from 3 to 4.5
   goals met: 0 of 1
4. (go_north_west b0)
   changed: (x b0) from 1.5 to 0, (y b0) from 4.5 to 6
   goals met: 0 of 1
5. (go_north_east b0)
   changed: (x b0) from 0 to 1.5, (y b0) from 6 to 7.5
   goals met: 0 of 1
6. (go_north_east b0)
   changed: (x b0) from 1.5 to 3, (y b0) from 7.5 to 9
   goals met: 0 of 1
7. (go_north_east b0)
   changed: (x b0) from 3 to 4.5, (y b0) from 9 to 10.5
   goals met: 0 of 1
8. (go_north_west b0)
   changed: (x b0) from 4.5 to 3, (y b0) from 10.5 to 12
   goals met: 0 of 1
9. (go_north_west b0)
   changed: (x b0) from 3 to 1.5, (y b0) from 12 to 13.5
   goals met: 0 of 1
10. (go_north_west b0)
   changed: (x b0) from 1.5 to 0, (y b0) from 13.5 to 15
   goals met: 0 of 1
11. (go_north_east b0)
   changed: (x b0) from 0 to 1.5, (y b0) from 15 to 16.5
   goals met: 0 of 1
12. (go_north_east b0)
   changed: (x b0) from 1.5 to 3, (y b0) from 16.5 to 18
   goals met: 0 of 1
13. (go_north_east b0)
   changed: (x b0) from 3 to 4.5, (y b0) from 18 to 19.5
   goals met: 0 of 1
14. (go_north_west b0)
   changed: (x b0) from 4.5 to 3, (y b0) from 19.5 to 21
   goals met: 0 of 1
15. (go_north_west b0)
   changed: (x b0) from 3 to 1.5, (y b0) from 21 to 22.5
   goals met: 0 of 1
16. (go_north_west b0)
   changed: (x b0) from 1.5 to 0, (y b0) from 22.5 to 24
   goals met: 0 of 1
17. (go_north_east b0)
   changed: (x b0) from 0 to 1.5, (y b0) from 24 to 25.5
   goals met: 0 of 1
18. (go_north_east b0)
   changed: (x b0) from 1.5 to 3, (y b0) from 25.5 to 27
   goals met: 0 of 1
19. (go_north_east b0)
   changed: (x b0) from 3 to 4.5, (y b0) from 27 to 28.5
   goals met: 0 of 1
20. (go_north_west b0)
   changed: (x b0) from 4.5 to 3, (y b0) from 28.5 to 30
   goals met: 0 of 1
21. (go_north_west b0)
   changed: (x b0) from 3 to 1.5, (y b0) from 30 to 31.5
   goals met: 0 of 1
22. (go_north_west b0)
   changed: (x b0) from 1.5 to 0, (y b0) from 31.5 to 33
   goals met: 0 of 1
23. (save_person b0 p0)
   added: (saved p0)
   goals met: 1 of 1
